# Radius Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CylindricalSurface..::..Radius Property
CylindricalSurface Class See Also
---
Radius of the circle that defines the base of this cylinder.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double Radius { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Radius As Double
	Get
```

Visual C++
---
```text
public:
property double Radius {
	double get ();
}
```

# See Also
CylindricalSurface Class
Autodesk.Revit.DB Namespace